### Create Pandas Dataframe from 2D List using pd.DataFrame()

In [11]:
import pandas as pd
lis =[ ['sanjay',25],['abhi',21],
      ['rakesh',89],['eshan',78]]

edt = pd.DataFrame(lis,columns = ["tag",'number'])
edt

      tag  number
0  sanjay      25
1    abhi      21
2  rakesh      89
3   eshan      78

### Create Pandas Dataframe from 2D List using pd.DataFrame.from_records()

In [17]:
columns = ['Name','age']

dd = pd.DataFrame.from_records(lis,columns = columns)
dd

     Name  age
0  sanjay   25
1    abhi   21
2  rakesh   89
3   eshan   78

### Create Pandas Dataframe from 2D List using pd.DataFrame.from_dict()

In [26]:
lis =[ ['sanjay',25],['abhi',21],
      ['rakesh',89],['eshan',78]]

dic = pd.DataFrame.from_dict(dict(zip(columns,zip(lis))))
dic

           Name         age
0  [sanjay, 25]  [abhi, 21]

In [36]:
df = {
    'name':['sanjay','abhui'],
    'age':[25,23]}

dff = pd.DataFrame(df)
dff

     name  age
0  sanjay   25
1   abhui   23

Using Pandas Dataframe with the index parameter

In [41]:
import pandas as pd 

# initialise data of lists. 
data = {'Area':['Array', 'Stack', 'Queue'],
        'Student_1':[20, 21, 19], 'Student_2':[15, 20, 14]} 

# Create DataFrame 
df = pd.DataFrame(data, index =['Cat_1', 'Cat_2', 'Cat_3']) 

# Print the output. 
print(df)

        Area  Student_1  Student_2
Cat_1  Array         20         15
Cat_2  Stack         21         20
Cat_3  Queue         19         14

#### Handling Missing Values

In [56]:
import numpy as np

# Creating a DataFrame with missing values from a list of lists
data = [['Geek1', 28, 'Engineer'],
        ['Geek2', None, 'Data Scientist'],
        ['Geek3', 32, None]]

colunns = ['name','age','accupation']
df = pd.DataFrame(data,columns = colunns)
df = df.replace({None:np.nan})
df

    name   age      accupation
0  Geek1  28.0        Engineer
1  Geek2   NaN  Data Scientist
2  Geek3  32.0             NaN

In [1]:
import pandas as pd
import numpy as np

data = {
    'Employee': ['E1','E2','E3','E4','E5','E6','E7','E8'],
    'Sales': [120, 80, 200, 150, 90, 300, 60, 400],
    'Experience': [2, 5, 3, 10, 1, 7, 2, 12],
    'Category': ['A', 'B', 'C', 'A', 'B', 'C', 'A', 'C']
}
df = pd.DataFrame(data)
print(df)

  Employee  Sales  Experience Category
0       E1    120           2        A
1       E2     80           5        B
2       E3    200           3        C
3       E4    150          10        A
4       E5     90           1        B
5       E6    300           7        C
6       E7     60           2        A
7       E8    400          12        C

In [17]:
results = []
for  row in df.itertuples(index = False):
    if row.Category == "A":
        bonus = row.Sales*row.Experience
    elif row.Category =="B":
        bonus =  row.Sales*row.Experience
    elif row.Category == "C":
        bonus = (row.Sales ** 2) / (row.Experience + 1)
    results.append(bonus)

df['bonus']= results
df

  Employee  Sales  Experience Category         bonus
0       E1    120           2        A    240.000000
1       E2     80           5        B    400.000000
2       E3    200           3        C  10000.000000
3       E4    150          10        A   1500.000000
4       E5     90           1        B     90.000000
5       E6    300           7        C  11250.000000
6       E7     60           2        A    120.000000
7       E8    400          12        C  12307.692308

In [19]:
import pandas as pd

record = {

 'Name': ['Ankit', 'Amit', 'Aishwarya', 'Priyanka', 'Priya', 'Shaurya' ],
 'Age': [21, 19, 20, 18, 17, 21],
 'Stream': ['Math', 'Commerce', 'Science', 'Math', 'Math', 'Science'],
 'Percentage': [88, 92, 95, 70, 65, 78] }

# create a dataframe
dataframe = pd.DataFrame(record, columns = ['Name', 'Age', 'Stream', 'Percentage'])

print("Given Dataframe :\n", dataframe) 

# selecting rows based on condition
rslt_df = dataframe[dataframe['Percentage']>80]

print('\nResult dataframe :\n', rslt_df)

Given Dataframe :
         Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20   Science          95
3   Priyanka   18      Math          70
4      Priya   17      Math          65
5    Shaurya   21   Science          78

Result dataframe :
         Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20   Science          95

In [21]:

import pandas as pd

record = {

 'Name': ['Ankit', 'Amit', 'Aishwarya', 'Priyanka', 'Priya', 'Shaurya' ],
 'Age': [21, 19, 20, 18, 17, 21],
 'Stream': ['Math', 'Commerce', 'Science', 'Math', 'Math', 'Science'],
 'Percentage': [88, 92, 95, 70, 65, 78] }

# create a dataframe
dataframe = pd.DataFrame(record, columns = ['Name', 'Age', 'Stream', 'Percentage'])

print("Given Dataframe :\n", dataframe) 

# selecting rows based on condition
rslt_df = dataframe[dataframe['Percentage']!=90]

print('\nResult dataframe :\n', rslt_df)

Given Dataframe :
         Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20   Science          95
3   Priyanka   18      Math          70
4      Priya   17      Math          65
5    Shaurya   21   Science          78

Result dataframe :
         Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20   Science          95
3   Priyanka   18      Math          70
4      Priya   17      Math          65
5    Shaurya   21   Science          78

In [25]:
# importing pandas
import pandas as pd

record = {
  'Name': ['Ankit', 'Amit', 'Aishwarya', 'Priyanka', 'Priya', 'Shaurya' ],
  'Age': [21, 19, 20, 18, 17, 21],
  'Stream': ['Math', 'Commerce', 'Science', 'Math', 'Math', 'Science'],
  'Percentage': [88, 92, 95, 70, 65, 78]}

# create a dataframe
dataframe = pd.DataFrame(record, columns = ['Name', 'Age', 'Stream', 'Percentage'])
dataframe

        Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20   Science          95
3   Priyanka   18      Math          70
4      Priya   17      Math          65
5    Shaurya   21   Science          78

In [31]:
optins = ["Math","Commerce"]
results = dataframe[dataframe['Stream'].isin(optins)]
results

       Name  Age    Stream  Percentage
0     Ankit   21      Math          88
1      Amit   19  Commerce          92
3  Priyanka   18      Math          70
4     Priya   17      Math          65

In [33]:
import pandas as pd 
  
# Create the dataframe 
df = pd.DataFrame({'Date':['10/2/2011', '11/2/2011', '12/2/2011', '13/2/11'], 
                    'Event':['Music', 'Poetry', 'Theatre', 'Comedy'], 
                    'Cost':[10000, 5000, 15000, 2000]}) 

# Create an empty list 
Row_list =[] 
  
# Iterate over each row 
for i in range((df.shape[0])): 
  
    # Using iloc to access the values of  
    # the current row denoted by "i" 
    Row_list.append(list(df.iloc[i, :])) 
  
# Print the first 3 elements 
print(Row_list[:3])

[['10/2/2011', 'Music', 10000], ['11/2/2011', 'Poetry', 5000], ['12/2/2011', 'Theatre', 15000]]